{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 16384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [16, 1024]}, "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6QUM6L1VzZXJzL0hhcnJ5L3NvdXJjZS9yZXBv\ncy90ZndvcmxkaGFja2F0aG9uL3NjcmlwdHMvR0FOTW9kZWxzLnB52gg8bGFtYmRhPhUAAADzAAAA\nAA==\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 25], "strides": [1, 4], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gF4\ncgIAAAByAgAAAPpBQzovVXNlcnMvSGFycnkvc291cmNlL3JlcG9zL3Rmd29ybGRoYWNrYXRob24v\nc2NyaXB0cy9HQU5Nb2RlbHMucHnaCDxsYW1iZGE+FwAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6QUM6L1VzZXJzL0hhcnJ5L3NvdXJjZS9yZXBv\ncy90ZndvcmxkaGFja2F0aG9uL3NjcmlwdHMvR0FOTW9kZWxzLnB52gg8bGFtYmRhPhwAAADzAAAA\nAA==\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 25], "strides": [1, 4], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_1", "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gF4\ncgIAAAByAgAAAPpBQzovVXNlcnMvSGFycnkvc291cmNlL3JlcG9zL3Rmd29ybGRoYWNrYXRob24v\nc2NyaXB0cy9HQU5Nb2RlbHMucHnaCDxsYW1iZGE+HgAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_2", "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6QUM6L1VzZXJzL0hhcnJ5L3NvdXJjZS9yZXBv\ncy90ZndvcmxkaGFja2F0aG9uL3NjcmlwdHMvR0FOTW9kZWxzLnB52gg8bGFtYmRhPiMAAADzAAAA\nAA==\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 25], "strides": [1, 4], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_2", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gF4\ncgIAAAByAgAAAPpBQzovVXNlcnMvSGFycnkvc291cmNlL3JlcG9zL3Rmd29ybGRoYWNrYXRob24v\nc2NyaXB0cy9HQU5Nb2RlbHMucHnaCDxsYW1iZGE+JQAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3", "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6QUM6L1VzZXJzL0hhcnJ5L3NvdXJjZS9yZXBv\ncy90ZndvcmxkaGFja2F0aG9uL3NjcmlwdHMvR0FOTW9kZWxzLnB52gg8bGFtYmRhPioAAADzAAAA\nAA==\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["re_lu_3", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 25], "strides": [1, 4], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_3", "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gF4\ncgIAAAByAgAAAPpBQzovVXNlcnMvSGFycnkvc291cmNlL3JlcG9zL3Rmd29ybGRoYWNrYXRob24v\nc2NyaXB0cy9HQU5Nb2RlbHMucHnaCDxsYW1iZGE+LAAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_4", "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6QUM6L1VzZXJzL0hhcnJ5L3NvdXJjZS9yZXBv\ncy90ZndvcmxkaGFja2F0aG9uL3NjcmlwdHMvR0FOTW9kZWxzLnB52gg8bGFtYmRhPjAAAADzAAAA\nAA==\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_8", "inbound_nodes": [[["re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_4", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 25], "strides": [1, 4], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_4", "inbound_nodes": [[["lambda_8", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gF4\ncgIAAAByAgAAAPpBQzovVXNlcnMvSGFycnkvc291cmNlL3JlcG9zL3Rmd29ybGRoYWNrYXRob24v\nc2NyaXB0cy9HQU5Nb2RlbHMucHnaCDxsYW1iZGE+MgAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "GANModels", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_9", "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "tanh"}, "name": "activation", "inbound_nodes": [[["lambda_9", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of19.bin", "group1-shard2of19.bin", "group1-shard3of19.bin", "group1-shard4of19.bin", "group1-shard5of19.bin", "group1-shard6of19.bin", "group1-shard7of19.bin", "group1-shard8of19.bin", "group1-shard9of19.bin", "group1-shard10of19.bin", "group1-shard11of19.bin", "group1-shard12of19.bin", "group1-shard13of19.bin", "group1-shard14of19.bin", "group1-shard15of19.bin", "group1-shard16of19.bin", "group1-shard17of19.bin", "group1-shard18of19.bin", "group1-shard19of19.bin"], "weights": [{"name": "conv2d_transpose/kernel", "shape": [1, 25, 512, 1024], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [1, 25, 256, 512], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [1, 25, 128, 256], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [1, 25, 64, 128], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_4/kernel", "shape": [1, 25, 1, 64], "dtype": "float32"}, {"name": "conv2d_transpose_4/bias", "shape": [1], "dtype": "float32"}, {"name": "dense/kernel", "shape": [100, 16384], "dtype": "float32"}, {"name": "dense/bias", "shape": [16384], "dtype": "float32"}]}]}